def task_1() -> None:
    # i–iii. создаём переменные с разными типами
    a = 10              # int
    b = 3.14            # float
    c = "Hello"         # str
    d = [1, 2, 3]       # list
    e = True            # bool

    # iv. выводим тип каждой переменной
    print(type(a))
    print(type(b))
    print(type(c))
    print(type(d))
    print(type(e))


# c. вызов функции
task_1()

def task_2() -> None:
    # i. список
    a = [1, 2, 3, 5, 8, 13, 21]

    # ii. вывод первых 3 значений
    print(a[:3])


# c. вызов функции
task_2()

Эта последовательность называется последовательность Фибоначчи.
Её особенность:
Каждое следующее число равно сумме двух предыдущих. 

def task_3(x: int) -> int:
    # возвращаем квадрат числа
    return x ** 2


# c. вывод результата вызова функции
print(task_3(5))
